app/controllers/articles_controller.rb

    def index
        @articles = Article.paginate(page: params[:page], per_page: 5)
---
SELECT "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"

    def create

        @article = Article.new(article_params)
        @article.user = User.first
        if @article.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "user_id") VALUES (?, ?, ?, ?)  [["title", "ruby on rails edit"], ["description", "hello i m ruby on rails"], ["created_at", "2021-10-07 17:46:52.931326"], ["user_id", 2]]

      def update
        if @article.update(article_params)
---
UPDATE "articles" SET "description" = ? WHERE "articles"."id" = ?  [["description", "new edited description"], ["id", 2]]