app/controllers/users_controller.rb

    def index
        @users = User.paginate(page: params[:page], per_page: 5)
---
SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

    def show
        @user = User.find(params[:id])
        @articles = @user.articles.paginate(page: params[:page], per_page: 5)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]

    def update
      @user = User.find(params[:id])
      if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["username", "vaish2 edited new"], ["updated_at", "2021-10-07 17:17:56.622050"], ["password_digest", "$2a$12$Dizuo8HTeqCBE442iBds5uVWb9.Xx9ywjt18chOTWhgjYNezBXtQq"], ["id", 3]]

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)